OpenFOAM_CaseDir/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1.0e-7;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

functions
{
    fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }
}

/*
    the following lines allows you to decompose the case for parallel execution 
    and not create additional folder for each processors.
*/


  OptimisationSwitches
  {  
      //- Parallel IO file handler
      // uncollated (default), collated or masterUncollated
      fileHandler collated;
  
      //- collated: thread buffer size for queued file writes. 
      // If set to 0 or not sufficient for the file size threading is not used. 
      // Default: 2e9
      maxThreadFileBufferSize 0;
  
      //- masterUncollated: non-blocking buffer size. 
      // If the file exceeds this buffer size scheduled transfer is used. 
      // Default: 2e9
      maxMasterFileBufferSize 2e9;
  }

// ************************************************************************* //
