OpenFOAM_CaseDir/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform 0.375;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    TOP
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    BOT
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    FRONT-WALL
    {
        type            symmetry;
    }
    BACK-WALL
    {
        type            symmetry;
    }
    CYLINDER
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }

}


// ************************************************************************* //
