OpenFOAM_CaseDir/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;

        smoother         DICGaussSeidel;

    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors	100;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;

    residualControl
    {
	p
	{
		relTol	0;
		tolerance 5e-6;	
	}

	U
	{
		relTol 0;
		tolerance 5e-6;
	}
    }
}

relaxationFactors
{
   equations
   {
	U	0.9;
	UFinal	1;
   }

   fields
   {
	p	0.9;
	pFinal	1;
   }
}
// ************************************************************************* //
